import React, {Component} from "react";

class Content extends Component {
    getRandomColor = () => {
        return '#' + Math.floor(Math.random()*16777215).toString(16);
    }

    changeColor = (event) => {
        const target = event.target;
        target.style.backgroundColor = this.getRandomColor();
        target.style.color = this.getRandomColor();
    };

    render() {
        return (
            <div>
                <p>Дата і місце народження: 22 травня,2003р.,м.Київ</p>
                <p>Освіта: Ліцей №208, м.Київ; НТУУ "КПІ",м.Київ </p>
                <p>Хоббі:</p>
                <ul>
                    <li>Економіка;</li>
                    <li>Йога та фітнес;</li>
                    <li>Книги;</li>
                    <li>Психологія.</li>
                </ul>
                <p id="changeBackgroundColor" onClick={this.changeColor}>Улюблені фільми:</p>
                <ol className="changeBackgroundColor2" onClick={this.changeColor}>
                    <li>"Сніданок у Тіффані";</li>
                    <li>"Зірка народилася";</li>
                    <li>"Диявол носить Prada";</li>
                </ol>
                <p>
                    Париж (фр. Paris) — столиця та найбільше місто Франції, розташоване в північній частині країни на
                    берегах річки Сени в центрі регіону Іль-де-Франс.
                    Це одне з найромантичніших і модних міст світу, який приваблює мільйони туристів знаменитими
                    пам’ятками, прекрасною архітектурою, модними бутиками й особливою атмосферою любові та свободи.<br/>
                    Париж — це місто любові й світла, столиця моди й літературний рай, місто тисячі облич, яке закохує в
                    себе з першого погляду.Заснування Парижа датується 3 століттям до н. е .
                    Саме в цей час на острові Сіте кельтським племенем паризіїв було засновано поселення, яке дало назву
                    спочатку галло-римському місту Паризію, а надалі трансформувалася в Париж.
                    Місто стало столицею Франції у 10 столітті й залишалося їй з невеликими перервами протягом багатьох
                    століть.<br/>
                    Париж прекрасний в будь-який сезон і будь-яку погоду. Але все ж ідеальним часом для відвідування
                    Парижа вважається квітень-травень і вересень-жовтень.
                    У цей час місто зазвичай радує гарною погодою і не такою великою кількістю туристів (хоча в Парижі
                    їх завжди досить).
                </p>
            </div>
        )
    }

}

export default Content;
